Scenarios/Statique/openfoam/Statique_openfoam_1st_iteration/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    rhoCustom
    {
        type        exprField;
        libs        ("libfieldFunctionObjects.so");

        field       rho_post;                
        result      volScalarField;
        dimensions  [1 -3 0 0 0 0 0];    // kg/m^3

        expression  "-2542.1 + 13.483*T - 0.0136*pow(T,2)";

        executeControl timeStep;
        executeInterval 1;

        writeControl writeTime;
        writeInterval 1;
    }
}
