Scenarios/Statique/openfoam/Statique_openfoam_1st_iteration/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name        rods;             
        patchInfo   { type wall; }
        constructFrom patches;       
        patches     (
                        rod_1_1
                        rod_1_2
                        rod_1_3
                        rod_1_4
                        rod_1_5
                        rod_1_6
                        rod_1_7
                        rod_1_8
                        rod_1_9
                        rod_1_10
                        rod_1_11
                        rod_1_12
                        rod_1_13
                        rod_1_14
                        rod_1_15
                        rod_1_16
                        rod_1_17
                        rod_2_1
                        rod_2_2
                        rod_2_3
                        rod_2_4
                        rod_2_5
                        rod_2_6
                        rod_2_7
                        rod_2_8
                        rod_2_9
                        rod_2_10
                        rod_2_11
                        rod_2_12
                        rod_2_13
                        rod_2_14
                        rod_2_15
                        rod_2_16
                        rod_2_17
                        rod_3_1
                        rod_3_2
                        rod_3_3
                        rod_3_4
                        rod_3_5
                        rod_3_6
                        rod_3_7
                        rod_3_8
                        rod_3_9
                        rod_3_10
                        rod_3_11
                        rod_3_12
                        rod_3_13
                        rod_3_14
                        rod_3_15
                        rod_3_16
                        rod_3_17
                        rod_4_1
                        rod_4_2
                        rod_4_3
                        rod_4_4
                        rod_4_5
                        rod_4_6
                        rod_4_7
                        rod_4_8
                        rod_4_9
                        rod_4_10
                        rod_4_11
                        rod_4_12
                        rod_4_13
                        rod_4_14
                        rod_4_15
                        rod_4_16
                        rod_4_17
                        rod_5_1
                        rod_5_2
                        rod_5_3
                        rod_5_4
                        rod_5_5
                        rod_5_6
                        rod_5_7
                        rod_5_8
                        rod_5_9
                        rod_5_10
                        rod_5_11
                        rod_5_12
                        rod_5_13
                        rod_5_14
                        rod_5_15
                        rod_5_16
                        rod_5_17
                        rod_6_1
                        rod_6_2
                        rod_6_3
                        rod_6_4
                        rod_6_5
                        rod_6_6
                        rod_6_7
                        rod_6_8
                        rod_6_9
                        rod_6_10
                        rod_6_11
                        rod_6_12
                        rod_6_13
                        rod_6_14
                        rod_6_15
                        rod_6_16
                        rod_6_17
                        rod_7_1
                        rod_7_2
                        rod_7_3
                        rod_7_4
                        rod_7_5
                        rod_7_6
                        rod_7_7
                        rod_7_8
                        rod_7_9
                        rod_7_10
                        rod_7_11
                        rod_7_12
                        rod_7_13
                        rod_7_14
                        rod_7_15
                        rod_7_16
                        rod_7_17
                        rod_8_1
                        rod_8_2
                        rod_8_3
                        rod_8_4
                        rod_8_5
                        rod_8_6
                        rod_8_7
                        rod_8_8
                        rod_8_9
                        rod_8_10
                        rod_8_11
                        rod_8_12
                        rod_8_13
                        rod_8_14
                        rod_8_15
                        rod_8_16
                        rod_8_17
                        rod_9_1
                        rod_9_2
                        rod_9_3
                        rod_9_4
                        rod_9_5
                        rod_9_6
                        rod_9_7
                        rod_9_8
                        rod_9_9
                        rod_9_10
                        rod_9_11
                        rod_9_12
                        rod_9_13
                        rod_9_14
                        rod_9_15
                        rod_9_16
                        rod_9_17
                        rod_10_1
                        rod_10_2
                        rod_10_3
                        rod_10_4
                        rod_10_5
                        rod_10_6
                        rod_10_7
                        rod_10_8
                        rod_10_9
                        rod_10_10
                        rod_10_11
                        rod_10_12
                        rod_10_13
                        rod_10_14
                        rod_10_15
                        rod_10_16
                        rod_10_17
                        rod_11_1
                        rod_11_2
                        rod_11_3
                        rod_11_4
                        rod_11_5
                        rod_11_6
                        rod_11_7
                        rod_11_8
                        rod_11_9
                        rod_11_10
                        rod_11_11
                        rod_11_12
                        rod_11_13
                        rod_11_14
                        rod_11_15
                        rod_11_16
                        rod_11_17
                        rod_12_1
                        rod_12_2
                        rod_12_3
                        rod_12_4
                        rod_12_5
                        rod_12_6
                        rod_12_7
                        rod_12_8
                        rod_12_9
                        rod_12_10
                        rod_12_11
                        rod_12_12
                        rod_12_13
                        rod_12_14
                        rod_12_15
                        rod_12_16
                        rod_12_17
                        rod_13_1
                        rod_13_2
                        rod_13_3
                        rod_13_4
                        rod_13_5
                        rod_13_6
                        rod_13_7
                        rod_13_8
                        rod_13_9
                        rod_13_10
                        rod_13_11
                        rod_13_12
                        rod_13_13
                        rod_13_14
                        rod_13_15
                        rod_13_16
                        rod_13_17
                        rod_14_1
                        rod_14_2
                        rod_14_3
                        rod_14_4
                        rod_14_5
                        rod_14_6
                        rod_14_7
                        rod_14_8
                        rod_14_9
                        rod_14_10
                        rod_14_11
                        rod_14_12
                        rod_14_13
                        rod_14_14
                        rod_14_15
                        rod_14_16
                        rod_14_17
                        rod_15_1
                        rod_15_2
                        rod_15_3
                        rod_15_4
                        rod_15_5
                        rod_15_6
                        rod_15_7
                        rod_15_8
                        rod_15_9
                        rod_15_10
                        rod_15_11
                        rod_15_12
                        rod_15_13
                        rod_15_14
                        rod_15_15
                        rod_15_16
                        rod_15_17
                        rod_16_1
                        rod_16_2
                        rod_16_3
                        rod_16_4
                        rod_16_5
                        rod_16_6
                        rod_16_7
                        rod_16_8
                        rod_16_9
                        rod_16_10
                        rod_16_11
                        rod_16_12
                        rod_16_13
                        rod_16_14
                        rod_16_15
                        rod_16_16
                        rod_16_17
                        rod_17_1
                        rod_17_2
                        rod_17_3
                        rod_17_4
                        rod_17_5
                        rod_17_6
                        rod_17_7
                        rod_17_8
                        rod_17_9
                        rod_17_10
                        rod_17_11
                        rod_17_12
                        rod_17_13
                        rod_17_14
                        rod_17_15
                        rod_17_16
                        rod_17_17

                    ); 
    }
);