Scenarios/Statique/openfoam/Statique_openfoam_1st_iteration/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
1909248
(
558.15
558.15
558.15
558.15
558.15
558.15
558.15
558.15
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 558.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    rods
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;           
        q               uniform 354434;       
        kappaMethod     fluidThermo;
        value           uniform 558.15;
    }
}

// ************************************************************************* //
