Scenarios/Statique/openfoam/Statique_openfoam_1st_iteration/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver      GAMG;
        smoother    DIC;
        tolerance   1e-9;
        relTol      0.01;           
        nFinestSweeps 2;
        nPreSweeps    2;
        nPostSweeps   2;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        scaleCorrection true;
    }

    p
    {
        solver      GAMG;
        smoother    DIC;
        tolerance   1e-9;
        relTol      0.01;             
        nFinestSweeps 2;
        nPreSweeps    2;
        nPostSweeps   2;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        scaleCorrection true;
    }

    "(k|epsilon|omega)"
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-10;
        relTol      0.1;
    }

    h
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-10;
        relTol      0;         
    }

    U
    {
        solver      smoothSolver;     
        smoother    symGaussSeidel;
        tolerance   1e-10;
        relTol      0.1;               
    }

}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-3;
        U               1e-4;
        h               1e-4;

        "(k|epsilon|omega)" 5e-3;
    }
}

relaxationFactors
{
    rho             1.0;
    p_rgh           0.6;
    p               0.7;
    U               0.7;
    h               0.8;
    "(k|epsilon|omega)" 0.8;
}


// ************************************************************************* //
